Revit 2026 API

# StructuralFramingUtilsFlipEnds Method

---

Flips the ends of the structural framing element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void FlipEnds(
	FamilyInstance familyInstance
)
```
```vb
Public Shared Sub FlipEnds (
	familyInstance As FamilyInstance
)
```
```cpp
public:
static void FlipEnds(
	FamilyInstance^ familyInstance
)
```
```fsharp
static member FlipEnds :
        familyInstance : FamilyInstance -> unit
```

#### Parameters

familyInstance FamilyInstance
     The FamilyInstance, which must be of a structural framing category, non-concrete.

| Exception | Condition |
| --- | --- |
| ArgumentException | The input familyInstance is concrete or is not a line, arc or ellipse element. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentsInconsistentException | The input familyInstance is not of a structural framing category. |

Only ends of non-concrete structural framing element like beam and brace can be flipped and only in case if it is a line, arc or ellipse element.

#### Reference

StructuralFramingUtils Class

Autodesk.Revit.DB.Structure Namespace